app/controllers/articles_controller.rb

  def index
    @articles = Article.search(params[:page], params[:query])
---
SELECT  "articles".* FROM "articles" ORDER BY "articles"."updated_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "body", "owner", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "記事1"], ["body", "本文です"], ["owner", "金井"], ["created_at", 2016-07-16 09:33:29 UTC], ["updated_at", 2016-07-16 09:33:29 UTC]]

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "body" = ?, "owner" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", "# markdown editor !!\r\n\r\n- hoge\r\n- fuga\r\n- moge\r\n\r\n    test code"], ["owner", "d.kanai"], ["updated_at", 2016-07-17 01:06:55 UTC], ["id", 20]]