app/controllers/s3images_controller.rb

  def index
    @s3images = S3image.all
---
SELECT "s3images".* FROM "s3images"

    def set_s3image
      @s3image = S3image.find(params[:id])
---
SELECT  "s3images".* FROM "s3images" WHERE "s3images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]